def generate_rows_for_5_3(row) -> list:
    """
    На основі рядка row створює 5 нових рядків,
    застосовуючи шаблон для випадку Значення 1 == 5 і Значення 2 == 3.
    """
    new_rows = [
        {"Значення 1": "1", "Значення 2": "1"},
        {"Значення 1": "1", "Значення 2": "1"},
        {"Значення 1": "1", "Значення 2": "1"},
        {"Значення 1": "1", "Значення 2": "0"},
        {"Значення 1": "1", "Значення 2": "0"},
    ]
    for new_row in new_rows:
        for col in ["Дата", "Область", "Місто", "lat", "long"]:
            new_row[col] = str(row[col])
        for i in range(3, 11):
            new_row[f"Значення {i}"] = "0"
    return new_rows
